Касательно настроек пользователя:
Возможности:
- смена аватарки (фотографии профиля);
- смена привязанной к аккаунту почты (e-mail);
- смена пароля от аккаута;
- смена паспорта (когда игра будет уже переделана под Black Impire.


Касательно управления:
Возможности:
- управление новостями: добавление, редактирование, удаление;
- управление пользователями: редактирование баланса, личной информации, информации о профиле, склада пользователей, бан;
- управление бан-листом: снятие бана, выдача бана;
- управление конфигурацией насосных станций.


Общие доработки к проекту:
- продумать и реализовать систему паспортов;
- реализовать техническую поддержку пользователей;
- доработать/оптимизировать код проекта.